package lesson_12_collections_2;

public class MyMain {
    public static void main(String[] args) {
        // Lambda expression specially for JAVA !!!!
        // API Stream !!!!!!!
        // GENERICS !!!
        // STRING + RegEX !!!

        // Collections: выделить отдельно время для хорошего понимания HashMap, и всего, что связано с HASH !!!

        // Наконец-то заучить базовые термины, ПАТТЕРН ПРОГРАММИРОВАНИЯ КОМПОЗИЦИЯ !!!

        // ПОПЫТАЙТЕСЬ НАПИСАТЬ БАЗОВУЮ ПРОГРАММУ С ИСПОЛЬЗОВАНИЕМ ВСЕХ ТЕХНОЛОГИЙ, КОТОРЫЕ МЫ ПРОШЛИ
        // ПРОЕКТ + добавите в ГИТ, ПОДГРУЗИТЕ ВСЕ В ГИТХАБ, БУДЕТЕ ПОСЛЕ КАЖДОГО БЛОГО ЛОГИЧЕСКОГО КОМИТИТЬ с
        // ОЧЕНЬ ЧЕТКИ ПОНЯТНЫМИ И ПРОФЕССИОНАЛЬНЫМИ КОММЕНТАРИЯМИ

        // ИЗУЧИЛИ МАССИВЫ
        // ООП - ИНКАПСУЛЯЦИЮ, ПОЛИМОРФИЗМ И НАСЛЕДОВАНИЕ + АБСТРАКЦИЯ (ИНТЕРФЕЙС)
        // КЛАСС - АБСТРАКТНЫЙ КЛАСС - ИНТРЕФЕЙС
        // ЗАДУМАТЬСЯ - НАСЛЕДОВАНИЕ ИЛИ КОМПОЗИЦИЯ, А МОЖЕТ ОБА?!
        // ИСКЛЮЧЕНИЯ - ВАША ПРОГРАММА ОБЫЧНО НАЧИНАЕТСЯ С ИСКЛЮЧЕНИЙ
        // СТРОЧКИ - StringBuilder
        // КОЛЛЕКЦИИ - КАКУЮ РЕАЛИЗАЦИЮ СОХРАНЕНИЯ ДАННЫХ Я БЫ ИСПОЛЬЗОВА ДЛЯ БОЛЕЕ ЭФФЕКТИВНОЙ РАБОТЫ

        // НАПИСАТЬ ПРОСТУЮ СИСТЕМУ КАТАЛОГОВ - ФОЛДЕРЫ, ФАЙЛЫ
        // ПРОГРАММА ПО ДЕЛЕНИЮ СТРОЧКИ НА ВВЕДЕННЫЕ ВАМИ УКАЗАТЕЛИ - разделить строчку по следующим знакам
    }
}